GopalSaraf/Practicals/PSDL/include/proc/pic16f18455.inc
#define CCP2PPS2                         BANKMASK(CCP2PPS), 2
#define CCP2PPS3                         BANKMASK(CCP2PPS), 3
#define CCP2PPS4                         BANKMASK(CCP2PPS), 4
#define CCP3CTS0                         BANKMASK(CCP3CAP), 0
#define CCP3CTS1                         BANKMASK(CCP3CAP), 1
#define CCP3CTS2                         BANKMASK(CCP3CAP), 2
#define CCP3CTS3                         BANKMASK(CCP3CAP), 3
#define CCP3CTS4                         BANKMASK(CCP3CAP), 4
#define CCP3CTS5                         BANKMASK(CCP3CAP), 5
#define CCP3CTS6                         BANKMASK(CCP3CAP), 6
#define CCP3CTS7                         BANKMASK(CCP3CAP), 7
#define CCP3EN                           BANKMASK(CCP3CON), 7
#define CCP3FMT                          BANKMASK(CCP3CON), 4
#define CCP3IE                           BANKMASK(PIE6), 2
#define CCP3IF                           BANKMASK(PIR6), 2
#define CCP3MD                           BANKMASK(PMD4), 2
#define CCP3MODE0                        BANKMASK(CCP3CON), 0
#define CCP3MODE1                        BANKMASK(CCP3CON), 1
#define CCP3MODE2                        BANKMASK(CCP3CON), 2
#define CCP3MODE3                        BANKMASK(CCP3CON), 3
#define CCP3OE                           BANKMASK(CCP3CON), 6
#define CCP3OUT                          BANKMASK(CCP3CON), 5
#define CCP3PPS0                         BANKMASK(CCP3PPS), 0
#define CCP3PPS1                         BANKMASK(CCP3PPS), 1
#define CCP3PPS2                         BANKMASK(CCP3PPS), 2
#define CCP3PPS3                         BANKMASK(CCP3PPS), 3
#define CCP3PPS4                         BANKMASK(CCP3PPS), 4
#define CCP4CTS0                         BANKMASK(CCP4CAP), 0
#define CCP4CTS1                         BANKMASK(CCP4CAP), 1
#define CCP4CTS2                         BANKMASK(CCP4CAP), 2
#define CCP4CTS3                         BANKMASK(CCP4CAP), 3
#define CCP4CTS4                         BANKMASK(CCP4CAP), 4
#define CCP4CTS5                         BANKMASK(CCP4CAP), 5
#define CCP4CTS6                         BANKMASK(CCP4CAP), 6
#define CCP4CTS7                         BANKMASK(CCP4CAP), 7
#define CCP4EN                           BANKMASK(CCP4CON), 7
#define CCP4FMT                          BANKMASK(CCP4CON), 4
#define CCP4IE                           BANKMASK(PIE6), 3
#define CCP4IF                           BANKMASK(PIR6), 3
#define CCP4MD                           BANKMASK(PMD4), 3
#define CCP4MODE0                        BANKMASK(CCP4CON), 0
#define CCP4MODE1                        BANKMASK(CCP4CON), 1
#define CCP4MODE2                        BANKMASK(CCP4CON), 2
#define CCP4MODE3                        BANKMASK(CCP4CON), 3
#define CCP4OE                           BANKMASK(CCP4CON), 6
#define CCP4OUT                          BANKMASK(CCP4CON), 5
#define CCP4PPS0                         BANKMASK(CCP4PPS), 0
#define CCP4PPS1                         BANKMASK(CCP4PPS), 1
#define CCP4PPS2                         BANKMASK(CCP4PPS), 2
#define CCP4PPS3                         BANKMASK(CCP4PPS), 3
#define CCP4PPS4                         BANKMASK(CCP4PPS), 4
#define CCP5CTS0                         BANKMASK(CCP5CAP), 0
#define CCP5CTS1                         BANKMASK(CCP5CAP), 1
#define CCP5CTS2                         BANKMASK(CCP5CAP), 2
#define CCP5CTS3                         BANKMASK(CCP5CAP), 3
#define CCP5CTS4                         BANKMASK(CCP5CAP), 4
#define CCP5CTS5                         BANKMASK(CCP5CAP), 5
#define CCP5CTS6                         BANKMASK(CCP5CAP), 6
#define CCP5CTS7                         BANKMASK(CCP5CAP), 7
#define CCP5EN                           BANKMASK(CCP5CON), 7
#define CCP5FMT                          BANKMASK(CCP5CON), 4
#define CCP5IE                           BANKMASK(PIE6), 4
#define CCP5IF                           BANKMASK(PIR6), 4
#define CCP5MD                           BANKMASK(PMD4), 4
#define CCP5MODE0                        BANKMASK(CCP5CON), 0
#define CCP5MODE1                        BANKMASK(CCP5CON), 1
#define CCP5MODE2                        BANKMASK(CCP5CON), 2
#define CCP5MODE3                        BANKMASK(CCP5CON), 3
#define CCP5OE                           BANKMASK(CCP5CON), 6
#define CCP5OUT                          BANKMASK(CCP5CON), 5
#define CCP5PPS0                         BANKMASK(CCP5PPS), 0
#define CCP5PPS1                         BANKMASK(CCP5PPS), 1
#define CCP5PPS2                         BANKMASK(CCP5PPS), 2
#define CCP5PPS3                         BANKMASK(CCP5PPS), 3
#define CCP5PPS4                         BANKMASK(CCP5PPS), 4
#define CDAFVR0                          BANKMASK(FVRCON), 2
#define CDAFVR1                          BANKMASK(FVRCON), 3
#define CDIV0                            BANKMASK(OSCCON2), 0
#define CDIV1                            BANKMASK(OSCCON2), 1
#define CDIV2                            BANKMASK(OSCCON2), 2
#define CDIV3                            BANKMASK(OSCCON2), 3
#define CH0                              BANKMASK(MD1CARH), 0
#define CH1                              BANKMASK(MD1CARH), 1
#define CH2                              BANKMASK(MD1CARH), 2
#define CH3                              BANKMASK(MD1CARH), 3
#define CHPOL                            BANKMASK(MD1CON1), 5
#define CHSYNC                           BANKMASK(MD1CON1), 4
#define CKE1                             BANKMASK(SSP1STAT), 6
#define CKE2                             BANKMASK(SSP2STAT), 6
#define CKP1                             BANKMASK(SSP1CON1), 4
#define CKP2                             BANKMASK(SSP2CON1), 4
#define CKPS3                            BANKMASK(T0CON1), 3
#define CKS0                             BANKMASK(NCO1CLK), 0
#define CKS1                             BANKMASK(NCO1CLK), 1
#define CKS2                             BANKMASK(NCO1CLK), 2
#define CKS3                             BANKMASK(NCO1CLK), 3
#define CL0                              BANKMASK(MD1CARL), 0
#define CL1                              BANKMASK(MD1CARL), 1
#define CL2                              BANKMASK(MD1CARL), 2
#define CL3                              BANKMASK(MD1CARL), 3
#define CLC1IE                           BANKMASK(PIE5), 4
#define CLC1IF                           BANKMASK(PIR5), 4
#define CLC1MD                           BANKMASK(PMD7), 1
#define CLC2IE                           BANKMASK(PIE5), 5
#define CLC2IF                           BANKMASK(PIR5), 5
#define CLC2MD                           BANKMASK(PMD7), 2
#define CLC3IE                           BANKMASK(PIE5), 6
#define CLC3IF                           BANKMASK(PIR5), 6
#define CLC3MD                           BANKMASK(PMD7), 3
#define CLC4IE                           BANKMASK(PIE5), 7
#define CLC4IF                           BANKMASK(PIR5), 7
#define CLC4MD                           BANKMASK(PMD7), 4
#define CLCIN0PPS0                       BANKMASK(CLCIN0PPS), 0
#define CLCIN0PPS1                       BANKMASK(CLCIN0PPS), 1
#define CLCIN0PPS2                       BANKMASK(CLCIN0PPS), 2
#define CLCIN0PPS3                       BANKMASK(CLCIN0PPS), 3
#define CLCIN0PPS4                       BANKMASK(CLCIN0PPS), 4
#define CLCIN1PPS0                       BANKMASK(CLCIN1PPS), 0
#define CLCIN1PPS1                       BANKMASK(CLCIN1PPS), 1
#define CLCIN1PPS2                       BANKMASK(CLCIN1PPS), 2
#define CLCIN1PPS3                       BANKMASK(CLCIN1PPS), 3
#define CLCIN1PPS4                       BANKMASK(CLCIN1PPS), 4
#define CLCIN2PPS0                       BANKMASK(CLCIN2PPS), 0
#define CLCIN2PPS1                       BANKMASK(CLCIN2PPS), 1
#define CLCIN2PPS2                       BANKMASK(CLCIN2PPS), 2
#define CLCIN2PPS3                       BANKMASK(CLCIN2PPS), 3
#define CLCIN2PPS4                       BANKMASK(CLCIN2PPS), 4
#define CLCIN3PPS0                       BANKMASK(CLCIN3PPS), 0
#define CLCIN3PPS1                       BANKMASK(CLCIN3PPS), 1
#define CLCIN3PPS2                       BANKMASK(CLCIN3PPS), 2
#define CLCIN3PPS3                       BANKMASK(CLCIN3PPS), 3
#define CLCIN3PPS4                       BANKMASK(CLCIN3PPS), 4
#define CLKRCLK0                         BANKMASK(CLKRCLK), 0
#define CLKRCLK1                         BANKMASK(CLKRCLK), 1
#define CLKRCLK2                         BANKMASK(CLKRCLK), 2
#define CLKRCLK3                         BANKMASK(CLKRCLK), 3
#define CLKRDC0                          BANKMASK(CLKRCON), 3
#define CLKRDC1                          BANKMASK(CLKRCON), 4
#define CLKRDIV0                         BANKMASK(CLKRCON), 0
#define CLKRDIV1                         BANKMASK(CLKRCON), 1
#define CLKRDIV2                         BANKMASK(CLKRCON), 2
#define CLKREN                           BANKMASK(CLKRCON), 7
#define CLKRMD                           BANKMASK(PMD0), 1
#define CLPOL                            BANKMASK(MD1CON1), 1
#define CLSYNC                           BANKMASK(MD1CON1), 0
#define CMP1MD                           BANKMASK(PMD3), 1
#define CMP2MD                           BANKMASK(PMD3), 2
#define CNT0                             BANKMASK(ADCNT), 0
#define CNT1                             BANKMASK(ADCNT), 1
#define CNT2                             BANKMASK(ADCNT), 2
#define CNT3                             BANKMASK(ADCNT), 3
#define CNT4                             BANKMASK(ADCNT), 4
#define CNT5                             BANKMASK(ADCNT), 5
#define CNT6                             BANKMASK(ADCNT), 6
#define CNT7                             BANKMASK(ADCNT), 7
#define CONT                             BANKMASK(ADCON0), 6
#define COSC0                            BANKMASK(OSCCON2), 4
#define COSC1                            BANKMASK(OSCCON2), 5
#define COSC2                            BANKMASK(OSCCON2), 6
#define CPON                             BANKMASK(ADCPCON0), 7
#define CPRDY                            BANKMASK(ADCPCON0), 0
#define CRS0                             BANKMASK(ADCON2), 4
#define CRS1                             BANKMASK(ADCON2), 5
#define CRS2                             BANKMASK(ADCON2), 6
#define CS                               BANKMASK(ADCON0), 4
#define CS5                              BANKMASK(ADCLK), 5
#define CSWHOLD                          BANKMASK(OSCCON3), 7
#define CSWIE                            BANKMASK(PIE1), 6
#define CSWIF                            BANKMASK(PIR1), 6
#define CWG1CS                           BANKMASK(CWG1CLK), 0
#define CWG1DAT0                         BANKMASK(CWG1ISM), 0
#define CWG1DAT1                         BANKMASK(CWG1ISM), 1
#define CWG1DAT2                         BANKMASK(CWG1ISM), 2
#define CWG1DAT3                         BANKMASK(CWG1ISM), 3
#define CWG1DBF0                         BANKMASK(CWG1DBF), 0
#define CWG1DBF1                         BANKMASK(CWG1DBF), 1
#define CWG1DBF2                         BANKMASK(CWG1DBF), 2
#define CWG1DBF3                         BANKMASK(CWG1DBF), 3
#define CWG1DBF4                         BANKMASK(CWG1DBF), 4
#define CWG1DBF5                         BANKMASK(CWG1DBF), 5
#define CWG1DBR0                         BANKMASK(CWG1DBR), 0
#define CWG1DBR1                         BANKMASK(CWG1DBR), 1
#define CWG1DBR2                         BANKMASK(CWG1DBR), 2
#define CWG1DBR3                         BANKMASK(CWG1DBR), 3
#define CWG1DBR4                         BANKMASK(CWG1DBR), 4
#define CWG1DBR5                         BANKMASK(CWG1DBR), 5
#define CWG1EN                           BANKMASK(CWG1CON0), 7
#define CWG1IE                           BANKMASK(PIE7), 0
#define CWG1IF                           BANKMASK(PIR7), 0
#define CWG1IN                           BANKMASK(CWG1CON1), 5
#define CWG1LD                           BANKMASK(CWG1CON0), 6
#define CWG1LSAC0                        BANKMASK(CWG1AS0), 2
#define CWG1LSAC1                        BANKMASK(CWG1AS0), 3
#define CWG1LSBD0                        BANKMASK(CWG1AS0), 4
#define CWG1LSBD1                        BANKMASK(CWG1AS0), 5
#define CWG1MD                           BANKMASK(PMD5), 5
#define CWG1MODE0                        BANKMASK(CWG1CON0), 0
#define CWG1MODE1                        BANKMASK(CWG1CON0), 1
#define CWG1MODE2                        BANKMASK(CWG1CON0), 2
#define CWG1OVRA                         BANKMASK(CWG1STR), 4
#define CWG1OVRB                         BANKMASK(CWG1STR), 5
#define CWG1OVRC                         BANKMASK(CWG1STR), 6
#define CWG1OVRD                         BANKMASK(CWG1STR), 7
#define CWG1POLA                         BANKMASK(CWG1CON1), 0
#define CWG1POLB                         BANKMASK(CWG1CON1), 1
#define CWG1POLC                         BANKMASK(CWG1CON1), 2
#define CWG1POLD                         BANKMASK(CWG1CON1), 3
#define CWG1PPS0                         BANKMASK(CWG1PPS), 0
#define CWG1PPS1                         BANKMASK(CWG1PPS), 1
#define CWG1PPS2                         BANKMASK(CWG1PPS), 2
#define CWG1PPS3                         BANKMASK(CWG1PPS), 3
#define CWG1PPS4                         BANKMASK(CWG1PPS), 4
#define CWG1REN                          BANKMASK(CWG1AS0), 6
#define CWG1SHUTDOWN                     BANKMASK(CWG1AS0), 7
#define CWG1STRA                         BANKMASK(CWG1STR), 0
#define CWG1STRB                         BANKMASK(CWG1STR), 1
#define CWG1STRC                         BANKMASK(CWG1STR), 2
#define CWG1STRD                         BANKMASK(CWG1STR), 3
#define CWG2CS                           BANKMASK(CWG2CLK), 0
#define CWG2DAT0                         BANKMASK(CWG2ISM), 0
#define CWG2DAT1                         BANKMASK(CWG2ISM), 1
#define CWG2DAT2                         BANKMASK(CWG2ISM), 2
#define CWG2DAT3                         BANKMASK(CWG2ISM), 3
#define CWG2DBF0                         BANKMASK(CWG2DBF), 0
#define CWG2DBF1                         BANKMASK(CWG2DBF), 1
#define CWG2DBF2                         BANKMASK(CWG2DBF), 2
#define CWG2DBF3                         BANKMASK(CWG2DBF), 3
#define CWG2DBF4                         BANKMASK(CWG2DBF), 4
#define CWG2DBF5                         BANKMASK(CWG2DBF), 5
#define CWG2DBR0                         BANKMASK(CWG2DBR), 0
#define CWG2DBR1                         BANKMASK(CWG2DBR), 1
#define CWG2DBR2                         BANKMASK(CWG2DBR), 2
#define CWG2DBR3                         BANKMASK(CWG2DBR), 3
#define CWG2DBR4                         BANKMASK(CWG2DBR), 4
#define CWG2DBR5                         BANKMASK(CWG2DBR), 5
#define CWG2EN                           BANKMASK(CWG2CON0), 7
#define CWG2IE                           BANKMASK(PIE7), 1
#define CWG2IF                           BANKMASK(PIR7), 1
#define CWG2IN                           BANKMASK(CWG2CON1), 5
#define CWG2LD                           BANKMASK(CWG2CON0), 6
#define CWG2LSAC0                        BANKMASK(CWG2AS0), 2
#define CWG2LSAC1                        BANKMASK(CWG2AS0), 3
#define CWG2LSBD0                        BANKMASK(CWG2AS0), 4
#define CWG2LSBD1                        BANKMASK(CWG2AS0), 5
#define CWG2MD                           BANKMASK(PMD5), 6
#define CWG2MODE0                        BANKMASK(CWG2CON0), 0
#define CWG2MODE1                        BANKMASK(CWG2CON0), 1
#define CWG2MODE2                        BANKMASK(CWG2CON0), 2
#define CWG2OVRA                         BANKMASK(CWG2STR), 4
#define CWG2OVRB                         BANKMASK(CWG2STR), 5
#define CWG2OVRC                         BANKMASK(CWG2STR), 6
#define CWG2OVRD                         BANKMASK(CWG2STR), 7
#define CWG2POLA                         BANKMASK(CWG2CON1), 0
#define CWG2POLB                         BANKMASK(CWG2CON1), 1
#define CWG2POLC                         BANKMASK(CWG2CON1), 2
#define CWG2POLD                         BANKMASK(CWG2CON1), 3
#define CWG2PPS0                         BANKMASK(CWG2PPS), 0
#define CWG2PPS1                         BANKMASK(CWG2PPS), 1
#define CWG2PPS2                         BANKMASK(CWG2PPS), 2
#define CWG2PPS3                         BANKMASK(CWG2PPS), 3
#define CWG2PPS4                         BANKMASK(CWG2PPS), 4
#define CWG2REN                          BANKMASK(CWG2AS0), 6
#define CWG2SHUTDOWN                     BANKMASK(CWG2AS0), 7
#define CWG2STRA                         BANKMASK(CWG2STR), 0
#define CWG2STRB                         BANKMASK(CWG2STR), 1
#define CWG2STRC                         BANKMASK(CWG2STR), 2
#define CWG2STRD                         BANKMASK(CWG2STR), 3
#define CWG3CS                           BANKMASK(CWG3CLK), 0
#define CWG3DAT0                         BANKMASK(CWG3ISM), 0
#define CWG3DAT1                         BANKMASK(CWG3ISM), 1
#define CWG3DAT2                         BANKMASK(CWG3ISM), 2
#define CWG3DAT3                         BANKMASK(CWG3ISM), 3
#define CWG3DBF0                         BANKMASK(CWG3DBF), 0
#define CWG3DBF1                         BANKMASK(CWG3DBF), 1
#define CWG3DBF2                         BANKMASK(CWG3DBF), 2
#define CWG3DBF3                         BANKMASK(CWG3DBF), 3
#define CWG3DBF4                         BANKMASK(CWG3DBF), 4
#define CWG3DBF5                         BANKMASK(CWG3DBF), 5
#define CWG3DBR0                         BANKMASK(CWG3DBR), 0
#define CWG3DBR1                         BANKMASK(CWG3DBR), 1
#define CWG3DBR2                         BANKMASK(CWG3DBR), 2
#define CWG3DBR3                         BANKMASK(CWG3DBR), 3
#define CWG3DBR4                         BANKMASK(CWG3DBR), 4
#define CWG3DBR5                         BANKMASK(CWG3DBR), 5
#define CWG3EN                           BANKMASK(CWG3CON0), 7
#define CWG3IE                           BANKMASK(PIE7), 2
#define CWG3IF                           BANKMASK(PIR7), 2
#define CWG3IN                           BANKMASK(CWG3CON1), 5
#define CWG3LD                           BANKMASK(CWG3CON0), 6
#define CWG3LSAC0                        BANKMASK(CWG3AS0), 2
#define CWG3LSAC1                        BANKMASK(CWG3AS0), 3
#define CWG3LSBD0                        BANKMASK(CWG3AS0), 4
#define CWG3LSBD1                        BANKMASK(CWG3AS0), 5
#define CWG3MD                           BANKMASK(PMD5), 7
#define CWG3MODE0                        BANKMASK(CWG3CON0), 0
#define CWG3MODE1                        BANKMASK(CWG3CON0), 1
#define CWG3MODE2                        BANKMASK(CWG3CON0), 2
#define CWG3OVRA                         BANKMASK(CWG3STR), 4
#define CWG3OVRB                         BANKMASK(CWG3STR), 5
#define CWG3OVRC                         BANKMASK(CWG3STR), 6
#define CWG3OVRD                         BANKMASK(CWG3STR), 7
#define CWG3POLA                         BANKMASK(CWG3CON1), 0
#define CWG3POLB                         BANKMASK(CWG3CON1), 1
#define CWG3POLC                         BANKMASK(CWG3CON1), 2
#define CWG3POLD                         BANKMASK(CWG3CON1), 3
#define CWG3PPS0                         BANKMASK(CWG3PPS), 0
#define CWG3PPS1                         BANKMASK(CWG3PPS), 1
#define CWG3PPS2                         BANKMASK(CWG3PPS), 2
#define CWG3PPS3                         BANKMASK(CWG3PPS), 3
#define CWG3PPS4                         BANKMASK(CWG3PPS), 4
#define CWG3REN                          BANKMASK(CWG3AS0), 6
#define CWG3SHUTDOWN                     BANKMASK(CWG3AS0), 7
#define CWG3STRA                         BANKMASK(CWG3STR), 0
#define CWG3STRB                         BANKMASK(CWG3STR), 1
#define CWG3STRC                         BANKMASK(CWG3STR), 2
#define CWG3STRD                         BANKMASK(CWG3STR), 3
#define DA1                              BANKMASK(SSP1STAT), 5
#define DA2                              BANKMASK(SSP2STAT), 5
#define DAC1EN                           BANKMASK(DAC1CON0), 7
#define DAC1MD                           BANKMASK(PMD3), 6
#define DAC1NSS                          BANKMASK(DAC1CON0), 0
#define DAC1OE1                          BANKMASK(DAC1CON0), 5
#define DAC1OE2                          BANKMASK(DAC1CON0), 4
#define DAC1PSS0                         BANKMASK(DAC1CON0), 2
#define DAC1PSS1                         BANKMASK(DAC1CON0), 3
#define DAC1R0                           BANKMASK(DAC1CON1), 0
#define DAC1R1                           BANKMASK(DAC1CON1), 1
#define DAC1R2                           BANKMASK(DAC1CON1), 2
#define DAC1R3                           BANKMASK(DAC1CON1), 3
#define DAC1R4                           BANKMASK(DAC1CON1), 4
#define DATA_ADDRESS1                    BANKMASK(SSP1STAT), 5
#define DATA_ADDRESS2                    BANKMASK(SSP2STAT), 5
#define DC                               BANKMASK(STATUS), 1
#define DOE                              BANKMASK(CPUDOZE), 4
#define DONE                             BANKMASK(ADCON0), 0
#define DOZE0                            BANKMASK(CPUDOZE), 0
#define DOZE1                            BANKMASK(CPUDOZE), 1
#define DOZE2                            BANKMASK(CPUDOZE), 2
#define DOZEN                            BANKMASK(CPUDOZE), 6
#define DSEN                             BANKMASK(ADCON1), 0
#define DSM1MD                           BANKMASK(PMD7), 0
#define D_A1                             BANKMASK(SSP1STAT), 5
#define D_A2                             BANKMASK(SSP2STAT), 5
#define D_nA1                            BANKMASK(SSP1STAT), 5
#define D_nA2                            BANKMASK(SSP2STAT), 5
#define ERR0                             BANKMASK(ADERRL), 0
#define ERR1                             BANKMASK(ADERRL), 1
#define ERR10                            BANKMASK(ADERRH), 2
#define ERR11                            BANKMASK(ADERRH), 3
#define ERR12                            BANKMASK(ADERRH), 4
#define ERR13                            BANKMASK(ADERRH), 5
#define ERR14                            BANKMASK(ADERRH), 6
#define ERR15                            BANKMASK(ADERRH), 7
#define ERR2                             BANKMASK(ADERRL), 2
#define ERR3                             BANKMASK(ADERRL), 3
#define ERR4                             BANKMASK(ADERRL), 4
#define ERR5                             BANKMASK(ADERRL), 5
#define ERR6                             BANKMASK(ADERRL), 6
#define ERR7                             BANKMASK(ADERRL), 7
#define ERR8                             BANKMASK(ADERRH), 0
#define ERR9                             BANKMASK(ADERRH), 1
#define EXTOEN                           BANKMASK(OSCEN), 7
#define EXTOR                            BANKMASK(OSCSTAT), 7
#define FLTR0                            BANKMASK(ADFLTRL), 0
#define FLTR1                            BANKMASK(ADFLTRL), 1
#define FLTR10                           BANKMASK(ADFLTRH), 2
#define FLTR11                           BANKMASK(ADFLTRH), 3
#define FLTR12                           BANKMASK(ADFLTRH), 4
#define FLTR13                           BANKMASK(ADFLTRH), 5
#define FLTR14                           BANKMASK(ADFLTRH), 6
#define FLTR15                           BANKMASK(ADFLTRH), 7
#define FLTR2                            BANKMASK(ADFLTRL), 2
#define FLTR3                            BANKMASK(ADFLTRL), 3
#define FLTR4                            BANKMASK(ADFLTRL), 4
#define FLTR5                            BANKMASK(ADFLTRL), 5
#define FLTR6                            BANKMASK(ADFLTRL), 6
#define FLTR7                            BANKMASK(ADFLTRL), 7
#define FLTR8                            BANKMASK(ADFLTRH), 0
#define FLTR9                            BANKMASK(ADFLTRH), 1
#define FM0                              BANKMASK(ADCON0), 2
#define FREE                             BANKMASK(NVMCON1), 4
#define FVREN                            BANKMASK(FVRCON), 7
#define FVRMD                            BANKMASK(PMD0), 6
#define FVRRDY                           BANKMASK(FVRCON), 6
#define G1EN                             BANKMASK(CWG1CON0), 7
#define G2EN                             BANKMASK(CWG2CON0), 7
#define G3EN                             BANKMASK(CWG3CON0), 7
#define GAOE                             BANKMASK(ADCON1), 4
